## staging: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # github_actions_secret.admin_aws_access_key[0] will be created
  + resource "github_actions_secret" "admin_aws_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "STAGING_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.admin_aws_secret_access_key[0] will be created
  + resource "github_actions_secret" "admin_aws_secret_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "STAGING_AWS_SECRET_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.admin_op_service_account_token[0] will be created
  + resource "github_actions_secret" "admin_op_service_account_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "OP_SERVICE_ACCOUNT_TOKEN_STAGING"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.admin_pr_review_env_security_group_ids[0] will be created
  + resource "github_actions_secret" "admin_pr_review_env_security_group_ids" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "PR_REVIEW_ENV_SECURITY_GROUP_IDS"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.admin_pr_review_env_subnet_ids[0] will be created
  + resource "github_actions_secret" "admin_pr_review_env_subnet_ids" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "PR_REVIEW_ENV_SUBNET_IDS"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Error: Error in function call

  on admin-secrets.tf line 26, in resource "github_actions_secret" "admin_cypress_env_json":
  26:   plaintext_value = base64decode(var.admin_cypress_env_json)
    ├────────────────
    │ while calling base64decode(str)

Call to function "base64decode" failed: failed to decode base64 data
(sensitive value).
time=2024-11-26T20:27:55Z level=error msg=terraform invocation failed in /home/runner/work/notification-terraform/notification-terraform/env/staging/github/.terragrunt-cache/cbY3wHtvFkTus-7utFNioY8A_H4/ziUKr5pa_JoeDZ3wgSbieuIpHJE/github error=[/home/runner/work/notification-terraform/notification-terraform/env/staging/github/.terragrunt-cache/cbY3wHtvFkTus-7utFNioY8A_H4/ziUKr5pa_JoeDZ3wgSbieuIpHJE/github] exit status 1 prefix=[/home/runner/work/notification-terraform/notification-terraform/env/staging/github] 
time=2024-11-26T20:27:55Z level=error msg=1 error occurred:
	* [/home/runner/work/notification-terraform/notification-terraform/env/staging/github/.terragrunt-cache/cbY3wHtvFkTus-7utFNioY8A_H4/ziUKr5pa_JoeDZ3wgSbieuIpHJE/github] exit status 1



```

</details>

